of/org/MGB/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          440;
        startFace       218709;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          440;
        startFace       219149;
    }
    inlet
    {
        type            patch;
        nFaces          250;
        startFace       219589;
    }
    outlet
    {
        type            patch;
        nFaces          250;
        startFace       219839;
    }
    deck
    {
        type            wall;
        inGroups        1(wall);
        nFaces          242;
        startFace       220089;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          219520;
        startFace       220331;
    }
)

// ************************************************************************* //
